In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series([1,4,3,5])
obj

0    1
1    4
2    3
3    5
dtype: int64

In [4]:
obj.values

array([1, 4, 3, 5], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([1,4,3,5], index = ['a', 'b', 'c' ,'d'])
obj2

a    1
b    4
c    3
d    5
dtype: int64

In [7]:
obj2['a'] = 6
obj2

a    6
b    4
c    3
d    5
dtype: int64

In [8]:
obj2*2

a    12
b     8
c     6
d    10
dtype: int64

In [9]:
obj2[obj2>5]

a    6
dtype: int64

In [10]:
sdata = {'Ohio':4500, 'Oregon':5000, 'Texas':100, 'Kansas':1000}
sdata

{'Kansas': 1000, 'Ohio': 4500, 'Oregon': 5000, 'Texas': 100}

In [12]:
obj3 = Series(sdata)
obj3

Kansas    1000
Ohio      4500
Oregon    5000
Texas      100
dtype: int64

In [13]:
new_state = ['SF', 'Washington', 'Oregon', 'Texas']
obj4 = Series(sdata, index = new_state)
obj4

SF               NaN
Washington       NaN
Oregon        5000.0
Texas          100.0
dtype: float64

In [14]:
obj3 + obj4

Kansas            NaN
Ohio              NaN
Oregon        10000.0
SF                NaN
Texas           200.0
Washington        NaN
dtype: float64

In [15]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
SF               NaN
Washington       NaN
Oregon        5000.0
Texas          100.0
Name: population, dtype: float64

In [17]:
obj.index = ['Joe', 'Jake','John','Pablo']
obj

Joe      1
Jake     4
John     3
Pablo    5
dtype: int64

 <br>

* ### DataFrame

In [26]:
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'year': [2000,2001,2002,2001,2000,],
       'pop':[1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada   200

In [27]:
frame = DataFrame(data, columns = ('year','state','pop'))
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4   200  Nevada  2.9

In [28]:
frame2 = DataFrame(data, columns = ('year','state','pop', 'debt'), index = range(1,6))
frame2

   year   state  pop debt
1  2000    Ohio  1.5  NaN
2  2001    Ohio  1.7  NaN
3  2002    Ohio  3.6  NaN
4  2001  Nevada  2.4  NaN
5   200  Nevada  2.9  NaN

In [30]:
frame2.loc[3]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 3, dtype: object

In [31]:
frame2['debt'] = range(1,6)
frame2

   year   state  pop  debt
1  2000    Ohio  1.5     1
2  2001    Ohio  1.7     2
3  2002    Ohio  3.6     3
4  2001  Nevada  2.4     4
5   200  Nevada  2.9     5

In [32]:
val = Series([8,7,6], index = range(3,6))
frame2['debt']=val
frame2

   year   state  pop  debt
1  2000    Ohio  1.5   NaN
2  2001    Ohio  1.7   NaN
3  2002    Ohio  3.6   8.0
4  2001  Nevada  2.4   7.0
5   200  Nevada  2.9   6.0

In [33]:
frame2['eastern'] = frame2['state']=='Ohio'
frame2

   year   state  pop  debt  eastern
1  2000    Ohio  1.5   NaN     True
2  2001    Ohio  1.7   NaN     True
3  2002    Ohio  3.6   8.0     True
4  2001  Nevada  2.4   7.0    False
5   200  Nevada  2.9   6.0    False

In [34]:
del frame2['eastern']
frame2

   year   state  pop  debt
1  2000    Ohio  1.5   NaN
2  2001    Ohio  1.7   NaN
3  2002    Ohio  3.6   8.0
4  2001  Nevada  2.4   7.0
5   200  Nevada  2.9   6.0

In [35]:
pop = {'Nevada': {2001:2.4, 2002:2.9},
      'Ohio': {2000:1.5, 2001:1.7, 2002:3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [36]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [38]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [40]:
pdata = {'Ohio':frame3['Ohio'][:-1],
        'Nevada':frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [41]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [43]:
frame3.name = 'state/pop'
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [45]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [46]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, 8.0],
       [2001, 'Nevada', 2.4, 7.0],
       [200, 'Nevada', 2.9, 6.0]], dtype=object)